In [2]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [6]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [8]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
columns = ["Name","Age","City","Salary"]
df2 = pd.DataFrame(data_list,columns =columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [10]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [12]:
df2['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [14]:
df2[["Name","City"]]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [16]:
df2["Designation"] = ["Dr.","Eng.","Eng.","Police"]

In [18]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000         Dr.
1   Anna   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000        Eng.
3  Linda   42    London   85000      Police

In [42]:
df2.drop("Designation",axis=1)

KeyError: "['Designation'] not found in axis"

In [20]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000         Dr.
1   Anna   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000        Eng.
3  Linda   42    London   85000      Police

In [22]:
df2.drop("Designation",axis=1, inplace= True)

In [24]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [26]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [28]:
df2.drop(["City","Salary"],axis=1)

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [30]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [32]:
df2.drop(["City","Salary"],axis=1,inplace= True)

In [34]:
df2

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [36]:
df2.drop(0,axis=0)

    Name  Age
1   Anna   34
2  Peter   29
3  Linda   42

In [40]:
df2.loc[[0,1]]

   Name  Age
0  John   28
1  Anna   34

In [42]:
df.iloc[2]

Name       Peter
Age           29
City      Berlin
Salary     62000
Name: 2, dtype: object

In [44]:
df.loc[[0,1]][["Name","Age"]]

   Name  Age
0  John   28
1  Anna   34

In [46]:
df2

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

In [ ]:
#age above 30

In [50]:
df[df["Age"]>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [ ]:
#age above 30 and from london

In [56]:
df[(df["Age"]>30) & (df["City"] == "London")]

    Name  Age    City  Salary
3  Linda   42  London   85000